In [1]:
import pandas as pd 
import numpy as np

In [2]:
from pandas import Series

#  lambda

In [3]:
f = lambda x,y: x + y 
f(1,4)

5

In [4]:
 def f(x , y): 
    return x + y

In [5]:
f = lambda x: x ** 2 
f(3)

9

In [6]:
f = lambda x: x+5 
f(3)

8

In [7]:
(lambda x: x +1)(5)

6

# map & replace

In [8]:
ex = [1,2,3,4,5] 
f = lambda x: x ** 2 
list(map(f, ex))

[1, 4, 9, 16, 25]

In [9]:
f = lambda x, y: x + y 
list(map(f, ex, ex))

[2, 4, 6, 8, 10]

In [10]:
list(map(lambda x: x+5, ex))

[6, 7, 8, 9, 10]

In [11]:
s1 = Series(np.arange(10)) 
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [12]:
s1.map(lambda x: x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [13]:
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [14]:
z = {1: 'A', 2: 'B', 3: 'C'} 
s1.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [15]:
s2 = Series(np.arange(10,20)) 
s2

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [16]:
s2 = Series(np.arange(10,20)) 
s1.map(s2)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [17]:
df = pd.read_csv("./data/wages.csv") 
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [18]:
 df.sex.unique()

array(['male', 'female'], dtype=object)

In [19]:
df["sex_code"] = df.sex.map({"male":0, "female":1})
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [20]:
 df.sex.replace( {"male":0, "female":1} ).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [21]:
df.sex.head(5)

0      male
1    female
2    female
3    female
4    female
Name: sex, dtype: object

In [22]:
 df.sex.replace( ["male", "female"], [0,1], inplace=True)

In [23]:
del df["sex_code"]

In [24]:
df.head()

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

# apply & applymap

In [25]:
df = pd.read_csv("wages.csv") 
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [26]:
df_info = df[["earn", "height","age"]] 
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [27]:
f = lambda x : x.max() - x.min() 
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64